/*[미션1] 진수변환기
2진수 돌아가며 말하기 게임
몇 명의 사람들이 모여서 2진수를 한 글자씩 끊어서 말하는 게임을 진행중이다.
2진수의 경우 이렇게 말하게 된다.

0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, …
코드복사
문제1) T개의 숫자까지 M명이 말한다고 할때 이를 모두 출력하는 프로그램을 만든다.
solution(2,4,2) //2진수, 4개의 숫자까지, 2명이 말할때

> ["0", "1", "1", "0", "1", "1", "1", "0", "0", "1", "0", "1", "1", "1", "0", "1", "1", "1"]
코드복사
parseInt 함수 사용가능
문제2) 길동이 차례 숫자 맞추기
홍길동의 차례에 어떤 숫자를 말해야 하는지를 알 수 있는 프로그램을 만든다.

문제3) n진수까지 되는 프로그램
2진수 뿐 아니라 16진수까지 동작하는 프로그램을 만든다.

파라미터로 진법 n, 미리 구할 숫자의 갯수 t, 게임에 참가하는 인원 m, 길동이의 순서 p 가 주어진다.
*/

//문제1
function solution(n,t,m,p){
    const
}